
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Текст = "Поменялась цена";

	РассчитатьСуммуСтроки(ТекущиеДанные, Текст);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Текст = "Поменялось количество";

	РассчитатьСуммуСтроки(ТекущиеДанные, Текст);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(Строка, ТекстПользователю)
	Строка.Сумма = Строка.Количество * Строка.Цена;
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстПользователю;
	Сообщение.Сообщить();

	Сотрудник = ОписаниеЧеловека();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Сотрудник.Имя;
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Функция ОписаниеЧеловека()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Антон");
	Человек.Вставить("СтажЛет", 15);
	Человек.Вставить("Уволен", Ложь);
	Человек.Вставить("ДатаПриемаНаРаботу", ТекущаяДата());
	
	Возврат Человек;

КонецФункции

#КонецОбласти
